# **โจทย์ Assignment03 การสร้างฐานข้อมูลและตาราง**
ให้ทำการสร้างฐานข้อมูลชื่อ pokemon.db โดยประกอบด้วย 2 ตาราง ได้แก่



1.   ตาราง CATCH_POKEMON ที่ 1 record ประกอบด้วย field ดังนี้
     
     **คีย์หลัก** ID ชนิดข้อมูลเป็น เลขจำนวนเต็ม แบบกำหนดค่าให้อัตโนมัติ

     KIND   ชนิดข้อมูลเป็น ข้อความ ที่ไม่รับค่าว่าง

     FOUND_NO  และ CAUGHT_NO ชนิดข้อมูลเป็น เลขจำนวนเต็ม ที่ไม่รับค่าว่าง
             
             
2.   ตาราง FIND_POKEMON ที่ 1 record ประกอบด้วย field ดังนี้

     **คีย์หลัก** ID ชนิดข้อมูลเป็น เลขจำนวนเต็ม แบบกำหนดค่าให้อัตโนมัติ

     KIND   ชนิดข้อมูลเป็น ข้อความ ที่ไม่รับค่าว่าง

     SCHOOL, PLAYGROUND และ SHOPPING_MALL ชนิดข้อมูลเป็น เลขจำนวนเต็ม ที่ไม่รับค่าว่าง

## **เชื่อมต่อฐานข้อมูล pokemon.db(Connect Database)**

In [3]:
# Phutharesuan Wachirapisut
# 651610348
# Lab03
# 229323 sec 002

In [1]:
import sqlite3

conn = sqlite3.connect("pokemon.db")

conn.close()

In [2]:
import sqlite3
conn = sqlite3.connect("Note.db")
conn.close()

## **Step1. สร้างตารางฐานข้อมูล (Create Table) และตาราง Pokemon**

In [3]:
conn = sqlite3.connect("pokemon.db")

with conn:
    conn.execute("""CREATE TABLE CATCH_POKEMON
                 (ID INT PRIMARY KEY NOT NULL,
                KIND TEXT NOT NULL,
                FOUND_NO INT NOT NULL,
                CAUGHT_NO INT NOT NULL
                 )""")
    
conn.close()

### นำข้อมูลเข้าตาราง catch_pokemon

In [2]:
conn = sqlite3.connect("pokemon.db")

with conn:

    conn.execute("INSERT INTO CATCH_POKEMON VALUES (1, 'Pikasu',    10,7)")
    conn.execute("INSERT INTO CATCH_POKEMON VALUES (2, 'Carpeter',  15,8)")
    conn.execute("INSERT INTO CATCH_POKEMON VALUES (3, 'Beedle',    32,24)")
    conn.execute("INSERT INTO CATCH_POKEMON VALUES (4, 'Poppo',     17,9)")
    conn.execute("INSERT INTO CATCH_POKEMON VALUES (5, 'Koratta',   16,12)")
    conn.execute("INSERT INTO CATCH_POKEMON VALUES (6, 'Onitsumi',  20,14)")
    conn.execute("INSERT INTO CATCH_POKEMON VALUES (7, 'Arbo',      28,17)")
    conn.execute("INSERT INTO CATCH_POKEMON VALUES (8, 'Konpang',   12,5)")
    conn.execute("INSERT INTO CATCH_POKEMON VALUES (9, 'Neauroma',  5,4)")
    conn.execute("INSERT INTO CATCH_POKEMON VALUES (10,'Tamatama',  18,8)")
    conn.execute("INSERT INTO CATCH_POKEMON VALUES (11,'Kokoon',    8,5)")
    conn.execute("INSERT INTO CATCH_POKEMON VALUES (12,'Pigeon',    26,17)")
    conn.execute("INSERT INTO CATCH_POKEMON VALUES (13,'Camel', 17,12)")
conn.close()

NameError: name 'sqlite3' is not defined

##**Step2. สร้างตาราง find_pokemon**

In [18]:
conn = sqlite3.connect("pokemon.db")

with conn:
    conn.execute("""CREATE TABLE FIND_POKEMON
                 (ID INT PRIMARY KEY NOT NULL,
                KIND TEXT NOT NULL,
                SCHOOL INT NOT NULL,
                PLAYGROUND INT NOT NULL,
                 SHOPPING_MALL INT NOT NULL
                 )""")
    
conn.close()

### นำข้อมูลเข้าตาราง find_pokemon

In [4]:
conn = sqlite3.connect("pokemon.db")

with conn:

    conn.execute("INSERT INTO FIND_POKEMON VALUES (1, 'Pikasu',    5,7,5)")
    conn.execute("INSERT INTO FIND_POKEMON VALUES (2, 'Carpeter',  8,5,10)")
    conn.execute("INSERT INTO FIND_POKEMON VALUES (3, 'Beedle',    18,13,25)")
    conn.execute("INSERT INTO FIND_POKEMON VALUES (4, 'Poppo',     10,7,9)")
    conn.execute("INSERT INTO FIND_POKEMON VALUES (5, 'Koratta',   12,8,10)")
    conn.execute("INSERT INTO FIND_POKEMON VALUES (6, 'Onitsumi',  11,9,14)")
    conn.execute("INSERT INTO FIND_POKEMON VALUES (7, 'Arbo',      15,22,8)")
    conn.execute("INSERT INTO FIND_POKEMON VALUES (8, 'Konpang',   7,6,6)")
    conn.execute("INSERT INTO FIND_POKEMON VALUES (9, 'Neauroma',  3,2,4)")
    conn.execute("INSERT INTO FIND_POKEMON VALUES (10,'Tamatama',  6,10,10)")
    conn.execute("INSERT INTO FIND_POKEMON VALUES (11,'Kokoon',    4,9,3)")
    conn.execute("INSERT INTO FIND_POKEMON VALUES (12,'Pigeon',    16,15,12)")
    conn.execute("INSERT INTO FIND_POKEMON VALUES (13,'Camel',     8,11,10)")
conn.close()

IntegrityError: UNIQUE constraint failed: FIND_POKEMON.ID

## **Utility สำหรับใช้ในการดูข้อมูล**

นักศึกษาสามารถใช้คำสั่ง get_data ในการเรียกดูข้อมูลในตาราง

In [5]:
import numpy as np
import pandas as pd

def get_data(cursor):
  all_rows = cursor.fetchall()
  #[all_rows.append(np.array(row)) for row in cursor]
  column_names = [description[0] for description in cursor.description]
  df = pd.DataFrame(data=all_rows, columns = column_names)
  # ซ่อน index
  blankIndex=[''] * len(df)
  df.index=blankIndex
  return df

## **คิวรี่ข้อมูลจากตาราง(Select From Table)**

เมื่อสร้างตารางทั้งสองสำเร็จข้อมูลจะต้องมีรูปแบบดังต่อไปนี้

In [6]:
conn = sqlite3.connect('pokemon.db')

with conn:
  cursor = conn.execute("SELECT KIND, FOUND_NO, CAUGHT_NO FROM CATCH_POKEMON")
#ไม่แสดง ID
df=get_data(cursor)
conn.close()
print("Operation done successfully")
df

Operation done successfully

      KIND  FOUND_NO  CAUGHT_NO
    Pikasu        10          7
  Carpeter        15          8
    Beedle        32         24
     Poppo        17          9
   Koratta        16         12
  Onitsumi        20         14
      Arbo        28         17
   Konpang        12          5
  Neauroma         5          4
  Tamatama        18          8
    Kokoon         8          5
    Pigeon        26         17
     Camel        17         12

In [7]:
conn = sqlite3.connect('pokemon.db')

with conn:
  cursor = conn.execute("SELECT * FROM FIND_POKEMON")

df=get_data(cursor)
conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID      KIND  SCHOOL  PLAYGROUND  SHOPPING_MALL
   1    Pikasu       5           7              5
   2  Carpeter       8           5             10
   3    Beedle      18          13             25
   4     Poppo      10           7              9
   5   Koratta      12           8             10
   6  Onitsumi      11           9             14
   7      Arbo      15          22              8
   8   Konpang       7           6              6
   9  Neauroma       3           2              4
  10  Tamatama       6          10             10
  11    Kokoon       4           9              3
  12    Pigeon      16          15             12
  13     Camel       8          11             10